---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.DuctSettings
source: html/cd632c8e-a520-2efb-a417-9dfa5677d134.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings

The duct setting class.

## Syntax (C#)
```csharp
public class DuctSettings : Element
```